# Electrical System Other Conductor Size Property

Source: https://www.revitapidocs.com/2026/a92ffd2e-3eed-32c4-4439-864f59d56902.htm

---

| Electrical System Other Conductor Size Property |
| --- |

The size of an Other Conductor in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId OtherConductorSize { get; }
```

```
Public ReadOnly Property OtherConductorSize As ElementId
	Get
```

```
public:
property ElementId^ OtherConductorSize {
	ElementId^ get ();
}
```

```
member OtherConductorSize : ElementId with get
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks Each Other Conductor has the same size in the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace